Documents/СписаниеСРасчетногоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СписаниеСРасчетногоСчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИИТ_ЭтапСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПланированияСписанияДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АС_МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АС_КомиссияМОЛПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АС_ОИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументПланирования</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументПланированияСписанияДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеЗаработнойПлаты</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеСРасчетногоСчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)

	//+ИИТ_Аксеньюшкин
	Элементы.ГруппаКонтрагент.Видимость = Истина;
	Элементы.Контрагент.Видимость = Истина;
	Элементы.ГруппаКонтрагент.Доступность = Истина;
	Элементы.Контрагент.Доступность = Истина;
	Элементы.ГруппаКонтрагент.ТолькоПросмотр = Ложь;
	Элементы.Контрагент.ТолькоПросмотр = Ложь;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ВидОперацииПриИзмененииСервер")
Процедура АЛФ_ВидОперацииПриИзмененииСервер()
	
	#Вставка 
	//При изменении вида операции сбрасывается счет
	СчетКонтрагента 	= Объект.СчетКонтрагента;
	ТаблицаРасшифровки 	= Объект.РасшифровкаПлатежа.Выгрузить(); 
	#КонецВставки
	СписаниеСРасчетногоСчетаФормы.ВидОперацииПриИзмененииСервер(ЭтотОбъект);

	ОтобразитьГиперссылкуПерейтиВТаблицу();
	
	#Область УХ_Казначейство
	ОперативноеПланированиеФормыУХ.ПриИзмененииВидаОперацииНаСервереДокументДДС(ЭтотОбъект);
	#КонецОбласти
	
	#Вставка 
	//При изменении вида операции сбрасывается счет
	Объект.СчетКонтрагента = СчетКонтрагента;
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда 
		Объект.Проект 									= ТаблицаРасшифровки[0].Проект;
		Объект.СтатьяДвиженияДенежныхСредств 			= ТаблицаРасшифровки[0].СтатьяДвиженияДенежныхСредств;
		Объект.СтатьяДвиженияДенежныхСредствЗачисление 	= ТаблицаРасшифровки[0].СтатьяДвиженияДенежныхСредств;
		Если Не ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда 
			  Объект.ДокументПланирования = ТаблицаРасшифровки[0].ДокументПланирования;
		КонецЕсли;	
	Иначе
		
	КонецЕсли;	 
	#КонецВставки

КонецПроцедуры

&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//СмирновРВ
	ПолеВвода_АЛФ = Элементы.Добавить("АС_ОИФ", Тип("ПолеФормы"), Элементы.ГруппаНомерДата);
	ПолеВвода_АЛФ.Заголовок 	= "ОИФ";
	ПолеВвода_АЛФ.Вид 			= ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным 	= "Объект.АС_ОИФ";	
	ПолеВвода_АЛФ.Доступность = Ложь;   
	ПолеВвода_АЛФ.Видимость = РольДоступна("АС_Кассир");
	
	НоваяГруппа = Элементы.Добавить("ГруппаАС_МОЛ", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛевая);
	НоваяГруппа.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.Отображение 		= ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;  
	
	НоваяГруппа.Видимость = Объект.АС_ОИФ И РольДоступна("АС_Кассир");
	
	ПолеВвода_АЛФ = Элементы.Добавить("АС_МОЛ", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Вид 			= ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным 	= "Объект.АС_МОЛ"; 
	ПолеВвода_АЛФ.Доступность 	= Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("АС_КомиссияМОЛПроцент", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Вид 			= ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным 	= "Объект.АС_КомиссияМОЛПроцент";
	ПолеВвода_АЛФ.Доступность 	= Ложь;
    //СмирновРВ

КонецПроцедуры
